experimental_cases/study_scripts/base_case_heat/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.21 -0.16 -0.21)
    (  0.21 -0.16 -0.21)
    (  0.21  0.5  -0.21)
    ( -0.21  0.5  -0.21)
    ( -0.21 -0.16  0.21)
    (  0.21 -0.16  0.21)
    (  0.21  0.5   0.21)
    ( -0.21  0.5   0.21)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 66 42) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall others
    (

        (0 4 7 3)
        (2 6 5 1)
        (0 3 2 1)
        (4 5 6 7)
    )
    
    patch bottom
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )

);

// ************************************************************************* //
