experimental_cases/study_scripts/base_case_heat/constant/momentumTransfer

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

drag
{
    blending        segregated;

    gas_dispersedIn_liquid
    {
        type            SchillerNaumann;
    }

    liquid_dispersedIn_gas
    {
        type            SchillerNaumann;
    }

    gas_segregatedWith_liquid
    {
        type            segregated;
        m               0.5;
        n               8;
    }
}

virtualMass
{
    gas_dispersedIn_liquid
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    liquid_dispersedIn_gas
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

lift
{}

wallLubrication
{
    gas_dispersedIn_liquid
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }

    liquid_dispersedIn_gas
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }
}

turbulentDispersion
{
    gas_dispersedIn_liquid
    {
        type            Burns;
        sigma           0.9;
    }

    liquid_dispersedIn_gas
    {
        type            Burns;
        sigma           0.9;
    }
}

// ************************************************************************* //

