experimental_cases/study_scripts/base_case_heat/0/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

#include "$FOAM_CASE/constant/caseVars"

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            turbulentInlet;
        fluctuationScale (0 0.1 0.01);
        referenceField  uniform (0 $Uin 0);
        value           uniform (0 $Uin 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           $internalField;
    }
    "vessel|heater|walls"
    {
        type            noSlip;
    }
    
    "shaft|impeller"
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }
    
    nonCouple
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }
}

// ************************************************************************* //
