experimental_cases/study_scripts/base_case_heat/0/epsilonm
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilonm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/constant/globalVars"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet
    {
        type            fixedValue;
        value           uniform $eps_inlet_mix;
    }

    outlet
    {
        type            inletOutlet;
        phi             phim;
        inletValue      $internalField;
        value           $internalField;
    }

    "vessel|shaft|heater|walls"
    {
        type            zeroGradient;//epsilonmWallFunction;
        value           $internalField;
    }
    
    impeller
    {
         type            zeroGradient;//epsilonmWallFunction;
         value           $internalField;  
    }

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //

