experimental_cases/study_scripts/base_case_heat/system/createZonesDict.sideHeater
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
heater
{
    type        annulus;
    zoneType    face;

    point1      (0 -1 0);
    point2      (0 0.02 0);
    outerRadius 0.05;
    innerRadius 0.0486;
}

// ************************************************************************* //
