experimental_cases/study_scripts/base_case_heat/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.liquid 0
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (1 0.03 1);
        fieldValues
        (
            volScalarFieldValue alpha.gas 0
            volScalarFieldValue alpha.liquid 1
        );
    }
);


// ************************************************************************* //

