experimental_cases/study_scripts/base_case_heat/system/topoSetDict.baffles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        action  new;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (-1  -1 -0.001) (-0.13  1 0.001);
    }
    {
        action  add;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (0.13 -1 -0.001 ) (1  1 0.001);
    }
    {
        action  add;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (-0.001 -1 -1) (0.001  1 -0.13);
    }
    {
        action  add;
        type    faceSet;
        name    baffles;
        source  boxToFace;
        box     (-0.001 -1 0.13) (0.001 1 1);
    }

);

// ************************************************************************* //
